#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

use cl_sys::{cl_context, cl_mem, cl_ulong, cl_float, cl_command_queue, cl_uint, cl_event};

pub const clfftVersionMajor: cl_uint = 2;
pub const clfftVersionMinor: cl_uint = 12;
pub const clfftVersionPatch: cl_uint = 2;

#[repr(i32)]
#[doc = "  @brief clfft error codes definition(incorporating OpenCL error definitions)"]
#[doc = ""]
#[doc = "   This enumeration is a superset of the OpenCL error codes.  For example, CL_OUT_OF_HOST_MEMORY,"]
#[doc = "   which is defined in cl.h is aliased as CLFFT_OUT_OF_HOST_MEMORY.  The set of basic OpenCL"]
#[doc = "   error codes is extended to add extra values specific to the clfft package."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum clfftStatus {
    CLFFT_INVALID_GLOBAL_WORK_SIZE = -63,
    CLFFT_INVALID_MIP_LEVEL = -62,
    CLFFT_INVALID_BUFFER_SIZE = -61,
    CLFFT_INVALID_GL_OBJECT = -60,
    CLFFT_INVALID_OPERATION = -59,
    CLFFT_INVALID_EVENT = -58,
    CLFFT_INVALID_EVENT_WAIT_LIST = -57,
    CLFFT_INVALID_GLOBAL_OFFSET = -56,
    CLFFT_INVALID_WORK_ITEM_SIZE = -55,
    CLFFT_INVALID_WORK_GROUP_SIZE = -54,
    CLFFT_INVALID_WORK_DIMENSION = -53,
    CLFFT_INVALID_KERNEL_ARGS = -52,
    CLFFT_INVALID_ARG_SIZE = -51,
    CLFFT_INVALID_ARG_VALUE = -50,
    CLFFT_INVALID_ARG_INDEX = -49,
    CLFFT_INVALID_KERNEL = -48,
    CLFFT_INVALID_KERNEL_DEFINITION = -47,
    CLFFT_INVALID_KERNEL_NAME = -46,

pub enum clfftDirection_ {
    #[doc = "< FFT transform from time to frequency domain."]
    CLFFT_FORWARD = -1,
    #[doc = "< FFT transform from frequency to time domain."]
    CLFFT_BACKWARD = 1,
    #[doc = "< The last value of the enum, and marks the length of clfftDirection."]
    ENDDIRECTION = 2,
}
#[doc = "  @brief Specify the expected direction of each FFT, time or the frequency domains"]
pub use self::clfftDirection_ as clfftDirection;
#[repr(u32)]
#[doc = "  @brief Specify wheter the input buffers are overwritten with results"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum clfftResultLocation_ {
    #[doc = "< Input and output buffers are the same (default)."]
    CLFFT_INPLACE = 1,
    #[doc = "< Input and output buffers are separate."]
    CLFFT_OUTOFPLACE = 2,
    #[doc = "< The last value of the enum, and marks the length of clfftPlaceness."]
    ENDPLACE = 3,
}
#[doc = "  @brief Specify wheter the input buffers are overwritten with results"]
pub use self::clfftResultLocation_ as clfftResultLocation;
#[repr(u32)]
#[doc = " @brief Determines whether the result is returned in original order. It is valid only for"]
#[doc = "dimensions greater than 1."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum clfftResultTransposed_ {
    #[doc = "< The result is returned in the original order (default)"]
    CLFFT_NOTRANSPOSE = 1,
    #[doc = "< The result is transposed where transpose kernel is supported (possibly faster)"]
    CLFFT_TRANSPOSED = 2,
    #[doc = "< The last value of the enum, and marks the length of clfftResultTransposed"]
    ENDTRANSPOSED = 3,
}
#[doc = " @brief Determines whether the result is returned in original order. It is valid only for"]
#[doc = "dimensions greater than 1."]
pub use self::clfftResultTransposed_ as clfftResultTransposed;
#[doc = " @brief Data structure that can be passed to clfftSetup() to control the behavior of the FFT runtime"]
#[doc = "  @details This structure contains values that can be initialized before instantiation of the FFT runtime"]
#[doc = "  with ::clfftSetup().  To initialize this structure, pass a pointer to a user struct to ::clfftInitSetupData( ),"]
#[doc = "  which clears the structure and sets the version member variables to the current values."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct clfftSetupData {
    #[doc = "< Major version number of the project; signifies possible major API changes."]
    pub major: cl_uint,
    #[doc = "< Minor version number of the project; minor API changes that can break backward compatibility."]
    pub minor: cl_uint,
    #[doc = "< Patch version number of the project; always incrementing number, signifies change over time."]
    pub patch: cl_uint,
    #[doc = " \tBitwise flags that control the behavior of library debug logic."]
    pub debugFlags: cl_ulong,
}
#[test]
fn bindgen_test_layout_clfftSetupData() {
    assert_eq!(
        ::std::mem::size_of::<clfftSetupData>(),
        24usize,
        concat!("Size of: ", stringify!(clfftSetupData))
    );
    assert_eq!(
        ::std::mem::align_of::<clfftSetupData>(),
        8usize,
        concat!("Alignment of ", stringify!(clfftSetupData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clfftSetupData>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clfftSetupData),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clfftSetupData>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(clfftSetupData),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clfftSetupData>())).patch as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(clfftSetupData),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clfftSetupData>())).debugFlags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(clfftSetupData),
            "::",
            stringify!(debugFlags)
        )
    );
}

#[repr(u32)]
#[doc = " @brief Type of Callback function."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum clfftCallbackType_ {
    #[doc = "< Callback function is invoked only once for every point of input at the beginning of FFT transform."]
    PRECALLBACK = 0,
    #[doc = "< Callback function is invoked only once for every point of output at the end of FFT transform."]
    POSTCALLBACK = 1,
}
#[doc = " @brief Type of Callback function."]
pub use self::clfftCallbackType_ as clfftCallbackType;
#[doc = "  @brief An abstract handle to the object that represents the state of the FFT(s)"]
pub type clfftPlanHandle = usize;
extern "C" {
    #[doc = " @brief Initialize the internal FFT resources."]
    #[doc = "  @details The internal resources include FFT implementation caches kernels, programs, and buffers."]
